using System;
using System.Net;

namespace DataParser
{
    public class Constants
    {
        public static string[]
            WebAsystKeys = (@"Наименование;""Наименование артикула"";""Код артикула"";Валюта;Цена;" +
<<<<<<< HEAD
                            @"""Доступен для заказа"";""Зачеркнутая цена"";""Закупочная цена"";" +
                            @"""Краткое описание"";Описание;" +
                            @"Теги;Заголовок;""Тип товаров""" +
                            @"""META Keywords"";""META Description"";""Ссылка на витрину"";" +
                            @"Производитель;Объем;Размеры;" + 
                            @"""Возраст детей"";Страна-производитель;Материал").Split(';');
=======
                                        @"""Доступен для заказа"";""Зачеркнутая цена"";""Закупочная цена"";" +
                                        @"""Краткое описание"";Описание;" +
                                        @"Теги;Заголовок;""Тип товаров""" +
                                        @"""META Keywords"";""META Description"";""Ссылка на витрину"";" +
                                        @"Производитель;Объем;Размеры;" + 
                                        @"""Возраст детей"";Страна-производитель;Материал").Split(';');
>>>>>>> 922872e980ae6f31e9ed62fca40d94d2c0590df2

        public static Func<string, string> WebAsystFormatter =
            s => $"\"{WebUtility.HtmlDecode(s.Trim()).Replace('"', '\'')}\"";

        public static byte[] BOM = {239, 187, 191};

    }
}
